{
  "id": "jueves-pierna-espalda-fase1-semana1",
  "title": "JUEVES · DÍA 2",
  "date": "2026-02-06",
  "focus": "Pierna + Espalda · Adaptación muscular",
  "phase": "Fase 1 - Adaptación",
  "week": 1,
  "summary": {
    "cardio": "7 min",
    "warmup": "8 min",
    "training": "28 min",
    "stretch": "5 min"
  },
  "blocks": [
    {
      "type": "cardio",
      "title": "Trote al gimnasio",
      "description": "Ritmo suave, como el martes. Aprovecha para activar las piernas con un trote ligero. No llegues fatigado.",
      "duration": "7 min",
      "items": []
    },
    {
      "type": "warmup",
      "title": "Activación de piernas y movilidad",
      "duration": "8 min",
      "items": [
        {
          "text": "Movilidad de tobillos: círculos con cada pie, 10 reps por dirección"
        },
        {
          "text": "Movilidad de rodillas: de pie, manos en las rodillas, haz círculos suaves · 10 reps cada dirección"
        },
        {
          "text": "Movilidad de caderas: círculos amplios con las caderas, 10 reps por dirección"
        },
        {
          "text": "Sentadillas sin peso: baja despacio, siente el movimiento · 2 series x 12 reps"
        },
        {
          "text": "Remo con banda o sin peso: activa la espalda · 2 series x 12 reps"
        },
        {
          "text": "Puentes de glúteo: tumbado boca arriba, sube la cadera apretando glúteos · 2 series x 15 reps"
        }
      ]
    },
    {
      "type": "stretch",
      "title": "Recuperación completa",
      "duration": "5 min",
      "items": [
        {
          "bold": "Cuádriceps:",
          "text": "De pie, agarra el tobillo por detrás y llévalo hacia el glúteo. 25 segundos por lado."
        },
        {
          "bold": "Isquiotibiales:",
          "text": "Sentado en el suelo, piernas extendidas, inclínate hacia adelante sin forzar. 30 segundos."
        },
        {
          "bold": "Dorsales:",
          "text": "De rodillas, extiende los brazos hacia adelante y baja el pecho al suelo. 30 segundos."
        },
        {
          "bold": "Lumbares (suave):",
          "text": "De rodillas, siéntate sobre los talones y estira los brazos hacia adelante (postura del niño). 35 segundos."
        }
      ]
    }
  ],
  "exercises": [
    {
      "id": "sentadilla-barra",
      "name": "Sentadilla con Barra (Back Squat)",
      "order": 1,
      "type": "principal",
      "series": 3,
      "reps": "10-12",
      "rest": "2 min",
      "weight": "solo barra (20kg)",
      "steps": [
        {
          "text": "Coloca la barra en el rack a la altura de tus hombros. Métete debajo y apóyala en la parte alta de la espalda (trapecios), no en el cuello."
        },
        {
          "text": "Agarra la barra con las manos un poco más ancho que los hombros. Pies separados ancho de hombros, puntas ligeramente hacia afuera."
        },
        {
          "text": "Saca la barra del rack dando 2-3 pasos atrás. Respira hondo, aprieta el core como si alguien fuera a golpearte el abdomen."
        },
        {
          "text": "Baja flexionando rodillas y caderas simultáneamente. Las rodillas van hacia adelante y ligeramente hacia afuera, siguiendo la línea de los pies. Baja hasta que los muslos estén paralelos al suelo (o un poco menos si sientes molestias)."
        },
        {
          "text": "Empuja con los talones para subir, manteniendo el pecho alto y la espalda recta. Exhala al subir. No dejes que las rodillas se vayan hacia dentro."
        }
      ],
      "tip": "Llevas 2 años parado. Hoy SOLO la barra vacía (20kg). Tu objetivo es dominar la técnica y sentir el movimiento, no mover peso. La semana que viene añades 5kg si te ha ido bien.",
      "alert": "Si sientes cualquier molestia en la espalda baja, para inmediatamente. Revisa que el core esté apretado y la espalda neutra. Si persiste, reduce la profundidad o hazlas en máquina hack squat."
    },
    {
      "id": "remo-barra-pendlay",
      "name": "Remo con Barra (Pendlay Row)",
      "order": 2,
      "type": "principal",
      "series": 3,
      "reps": "10-12",
      "rest": "90s",
      "weight": "30-40kg",
      "steps": [
        {
          "text": "Coloca la barra en el suelo con discos que permitan que esté a unos 20cm del suelo. Pies ancho de caderas."
        },
        {
          "text": "Inclínate hacia adelante con bisagra de cadera (como el peso muerto rumano), rodillas ligeramente flexionadas. El torso debe estar casi paralelo al suelo."
        },
        {
          "text": "Agarra la barra con las manos un poco más ancho que los hombros, palmas hacia ti. Espalda completamente recta, core apretado."
        },
        {
          "text": "Tira de la barra hacia tu abdomen bajo, llevando los codos hacia atrás. Aprieta las escápulas al final del movimiento."
        },
        {
          "text": "Baja la barra de forma controlada hasta que toque el suelo (o casi). Cada repetición empieza desde abajo."
        }
      ],
      "tip": "La clave está en mantener la posición del torso estable. No uses impulso ni balancees el cuerpo. Si te cuesta mantener la postura, haz remo en máquina sentado.",
      "alert": "Si tus lumbares están sensibles por las sentadillas, CAMBIA a remo en máquina o polea baja sentado. No hay que ser héroe la primera semana."
    },
    {
      "id": "prensa-piernas",
      "name": "Prensa de Piernas",
      "order": 3,
      "type": "secundario",
      "series": 3,
      "reps": "12-15",
      "rest": "90s",
      "weight": "60-80kg",
      "steps": [
        {
          "text": "Siéntate en la máquina de prensa. Espalda y cabeza bien apoyadas en el respaldo. Agarra las asas laterales."
        },
        {
          "text": "Coloca los pies en la plataforma a la anchura de los hombros, en el centro de la plataforma."
        },
        {
          "text": "Suelta los seguros y baja la plataforma flexionando las rodillas. Baja hasta que las rodillas lleguen cerca del pecho (90 grados o un poco más)."
        },
        {
          "text": "Empuja con toda la planta del pie, especialmente talones. Extiende las piernas pero sin bloquear completamente las rodillas arriba."
        }
      ],
      "tip": "Aquí puedes meter más peso que en sentadilla porque tu espalda está completamente apoyada. Perfecto para trabajar las piernas sin preocuparte de las lumbares."
    },
    {
      "id": "jalones-agarre-neutro",
      "name": "Jalones Agarre Neutro (o Dominadas Asistidas)",
      "order": 4,
      "type": "secundario",
      "series": 3,
      "reps": "10-12",
      "rest": "75s",
      "weight": "ajustar a capacidad",
      "steps": [
        {
          "text": "Siéntate en la máquina de jalones con agarre neutro (palmas enfrentadas). Si tu gimnasio no tiene este agarre, usa el supino (palmas hacia ti)."
        },
        {
          "text": "Mete las piernas bajo las almohadillas. Agarra el handle, inclínate ligeramente hacia atrás (10-15 grados)."
        },
        {
          "text": "Tira del handle hacia la parte alta del pecho, llevando los codos hacia abajo y apretando las escápulas."
        },
        {
          "text": "Sube de forma controlada hasta que los brazos estén casi extendidos arriba. Siente el estiramiento en la espalda."
        }
      ],
      "tip": "El agarre neutro es más amable con los hombros. Si puedes hacer dominadas sin asistencia (aunque sean 3-4), hazlas. Si no, máquina asistida o jalones."
    },
    {
      "id": "curl-femoral",
      "name": "Curl Femoral en Máquina",
      "order": 5,
      "type": "secundario",
      "series": 3,
      "reps": "12",
      "rest": "75s",
      "weight": "20-30kg",
      "steps": [
        {
          "text": "Túmbate boca abajo (o siéntate si es máquina sentada) en la máquina de curl femoral. Ajusta el rodillo para que quede justo por encima de los tobillos."
        },
        {
          "text": "Agarra las asas para estabilizarte. Piernas extendidas."
        },
        {
          "text": "Flexiona las rodillas llevando los talones hacia los glúteos. Contrae bien los isquiotibiales en la parte alta del movimiento."
        },
        {
          "text": "Baja de forma controlada hasta la posición inicial. No dejes caer el peso."
        }
      ],
      "tip": "Los isquiotibiales son fundamentales para la salud de las rodillas y protegen la espalda baja. Dale importancia a este ejercicio aunque parezca secundario."
    },
    {
      "id": "plancha-abdominal",
      "name": "Plancha Abdominal",
      "order": 6,
      "type": "core",
      "series": 3,
      "reps": "30-45s",
      "rest": "60s",
      "steps": [
        {
          "text": "Apóyate en los antebrazos y las puntas de los pies. El cuerpo forma una línea recta de cabeza a talones."
        },
        {
          "text": "Aprieta el abdomen fuertemente y también los glúteos. No dejes caer las caderas ni las subas."
        },
        {
          "text": "Mantén la posición respirando de forma controlada. Si empiezas a temblar mucho, para y descansa."
        }
      ],
      "alert": "Este ejercicio es FUNDAMENTAL para proteger tus lumbares después del trabajo de pierna. No te lo saltes nunca."
    },
    {
      "id": "bird-dog",
      "name": "Bird Dog (Perro de Muestra)",
      "order": 7,
      "type": "core",
      "series": 3,
      "reps": "10 por lado",
      "rest": "45s",
      "steps": [
        {
          "text": "Colócate a cuatro patas (manos bajo los hombros, rodillas bajo las caderas). Espalda completamente plana."
        },
        {
          "text": "Aprieta el core como si alguien fuera a golpearte en el abdomen."
        },
        {
          "text": "Extiende simultáneamente el brazo derecho hacia adelante (a la altura del oído) y la pierna izquierda hacia atrás (paralela al suelo). Mantén 2 segundos."
        },
        {
          "text": "Vuelve a la posición inicial de forma controlada. Repite con el otro lado (brazo izquierdo + pierna derecha). Eso es 1 rep por lado."
        }
      ],
      "tip": "Este ejercicio enseña a tu core a estabilizar la columna mientras mueves las extremidades. Es EXCELENTE para prevenir dolor lumbar y clave después de un día de sentadillas.",
      "alert": "La clave es NO rotar el tronco ni las caderas. Tu espalda debe permanecer completamente estable. Si no puedes, reduce el rango de movimiento o haz menos reps con técnica perfecta."
    }
  ]
}